Ran Plan for 2 projects:

1. dir: `nz3es/gcp/stg/australia-southeast2` workspace: `default`
1. dir: `nz3es/gcp/prd/australia-southeast2` workspace: `default`
---

### 1. dir: `nz3es/gcp/stg/australia-southeast2` workspace: `default`
<details><summary>Show Output</summary>

```diff
Workspace directory does not exist yet, skipping cache cleanup

09:56:34.548 INFO   Downloading Terraform configurations from ../../../../modules/vpc into ./.terragrunt-cache/BlotAs_HhHIEmOXGBXYvyr_8-Jw/INCXCkxQUlJDA4yuhPrPtRPp1Kk
09:56:34.591 INFO   terraform1.13.3: Initializing the backend...
09:56:35.330 INFO   terraform1.13.3: 
09:56:35.330 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
09:56:35.330 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
09:56:35.615 INFO   terraform1.13.3: Initializing provider plugins...
09:56:35.615 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 4.0.0"...
09:56:35.820 INFO   terraform1.13.3: - Using hashicorp/google v7.15.0 from the shared cache directory
09:56:36.156 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
09:56:36.156 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
09:56:36.156 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
09:56:36.156 INFO   terraform1.13.3: you run "terraform init" in the future.
09:56:36.156 INFO   terraform1.13.3: ╷
09:56:36.156 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
09:56:36.156 INFO   terraform1.13.3: │ 
09:56:36.156 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
09:56:36.157 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
09:56:36.157 INFO   terraform1.13.3: │   - hashicorp/google
09:56:36.157 INFO   terraform1.13.3: │ 
09:56:36.157 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
09:56:36.157 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
09:56:36.157 INFO   terraform1.13.3: │ these providers.
09:56:36.157 INFO   terraform1.13.3: │ 
09:56:36.157 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
09:56:36.158 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
09:56:36.158 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
09:56:36.158 INFO   terraform1.13.3: ╵
09:56:36.158 INFO   terraform1.13.3: Terraform has been successfully initialized!
09:56:39.130 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
09:56:39.130 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
09:56:39.130 STDOUT terraform1.13.3:   + create
09:56:39.130 STDOUT terraform1.13.3: Terraform will perform the following actions:
09:56:39.130 STDOUT terraform1.13.3:   # google_compute_network.vpc_network will be created
09:56:39.131 STDOUT terraform1.13.3:   + resource "google_compute_network" "vpc_network" {
09:56:39.131 STDOUT terraform1.13.3:       + auto_create_subnetworks                   = false
09:56:39.131 STDOUT terraform1.13.3:       + bgp_always_compare_med                    = (known after apply)
09:56:39.131 STDOUT terraform1.13.3:       + bgp_best_path_selection_mode              = (known after apply)
09:56:39.131 STDOUT terraform1.13.3:       + bgp_inter_region_cost                     = (known after apply)
09:56:39.132 STDOUT terraform1.13.3:       + delete_bgp_always_compare_med             = false
09:56:39.132 STDOUT terraform1.13.3:       + delete_default_routes_on_create           = false
09:56:39.132 STDOUT terraform1.13.3:       + gateway_ipv4                              = (known after apply)
09:56:39.132 STDOUT terraform1.13.3:       + id                                        = (known after apply)
09:56:39.132 STDOUT terraform1.13.3:       + internal_ipv6_range                       = (known after apply)
09:56:39.133 STDOUT terraform1.13.3:       + mtu                                       = (known after apply)
09:56:39.133 STDOUT terraform1.13.3:       + name                                      = "stg-vpc-australia-southeast2"
09:56:39.133 STDOUT terraform1.13.3:       + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
09:56:39.133 STDOUT terraform1.13.3:       + network_id                                = (known after apply)
09:56:39.134 STDOUT terraform1.13.3:       + numeric_id                                = (known after apply)
09:56:39.134 STDOUT terraform1.13.3:       + project                                   = "iac-01"
09:56:39.134 STDOUT terraform1.13.3:       + routing_mode                              = (known after apply)
09:56:39.134 STDOUT terraform1.13.3:       + self_link                                 = (known after apply)
09:56:39.135 STDOUT terraform1.13.3:     }
09:56:39.135 STDOUT terraform1.13.3:   # google_compute_subnetwork.subnet will be created
09:56:39.135 STDOUT terraform1.13.3:   + resource "google_compute_subnetwork" "subnet" {
09:56:39.135 STDOUT terraform1.13.3:       + creation_timestamp         = (known after apply)
09:56:39.136 STDOUT terraform1.13.3:       + external_ipv6_prefix       = (known after apply)
09:56:39.136 STDOUT terraform1.13.3:       + fingerprint                = (known after apply)
09:56:39.136 STDOUT terraform1.13.3:       + gateway_address            = (known after apply)
09:56:39.136 STDOUT terraform1.13.3:       + id                         = (known after apply)
09:56:39.137 STDOUT terraform1.13.3:       + internal_ipv6_prefix       = (known after apply)
09:56:39.137 STDOUT terraform1.13.3:       + ip_cidr_range              = "10.1.0.0/24"
09:56:39.137 STDOUT terraform1.13.3:       + ipv6_cidr_range            = (known after apply)
09:56:39.137 STDOUT terraform1.13.3:       + ipv6_gce_endpoint          = (known after apply)
09:56:39.137 STDOUT terraform1.13.3:       + name                       = "stg-vpc-australia-southeast2-subnet"
09:56:39.138 STDOUT terraform1.13.3:       + network                    = (known after apply)
09:56:39.138 STDOUT terraform1.13.3:       + private_ip_google_access   = (known after apply)
09:56:39.138 STDOUT terraform1.13.3:       + private_ipv6_google_access = (known after apply)
09:56:39.138 STDOUT terraform1.13.3:       + project                    = "iac-01"
09:56:39.138 STDOUT terraform1.13.3:       + purpose                    = (known after apply)
09:56:39.138 STDOUT terraform1.13.3:       + region                     = "australia-southeast2"
09:56:39.138 STDOUT terraform1.13.3:       + self_link                  = (known after apply)
09:56:39.139 STDOUT terraform1.13.3:       + stack_type                 = (known after apply)
09:56:39.139 STDOUT terraform1.13.3:       + state                      = (known after apply)
09:56:39.139 STDOUT terraform1.13.3:       + subnetwork_id              = (known after apply)
09:56:39.139 STDOUT terraform1.13.3:       + secondary_ip_range (known after apply)
09:56:39.139 STDOUT terraform1.13.3:     }
09:56:39.139 STDOUT terraform1.13.3: Plan: 2 to add, 0 to change, 0 to destroy.
09:56:39.139 STDOUT terraform1.13.3: 
09:56:39.139 STDOUT terraform1.13.3: Changes to Outputs:
09:56:39.139 STDOUT terraform1.13.3:   + network_id       = (known after apply)
09:56:39.140 STDOUT terraform1.13.3:   + subnet_self_link = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/stg/australia-southeast2
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Fiac%252Fnz3es%252Fgcp%252Fstg%252Faustralia-southeast2%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/stg/australia-southeast2
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 2. dir: `nz3es/gcp/prd/australia-southeast2` workspace: `default`
<details><summary>Show Output</summary>

```diff
Workspace directory does not exist yet, skipping cache cleanup

09:56:34.435 INFO   Downloading Terraform configurations from ../../../../modules/vpc into ./.terragrunt-cache/-qhF2Xgq6F985kZ0_f78XZWc7bs/INCXCkxQUlJDA4yuhPrPtRPp1Kk
09:56:34.483 INFO   terraform1.13.3: Initializing the backend...
09:56:35.252 INFO   terraform1.13.3: 
09:56:35.252 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
09:56:35.252 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
09:56:35.536 INFO   terraform1.13.3: Initializing provider plugins...
09:56:35.536 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 4.0.0"...
09:56:35.781 INFO   terraform1.13.3: - Using hashicorp/google v7.15.0 from the shared cache directory
09:56:36.122 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
09:56:36.122 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
09:56:36.122 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
09:56:36.122 INFO   terraform1.13.3: you run "terraform init" in the future.
09:56:36.122 INFO   terraform1.13.3: ╷
09:56:36.122 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
09:56:36.122 INFO   terraform1.13.3: │ 
09:56:36.122 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
09:56:36.123 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
09:56:36.123 INFO   terraform1.13.3: │   - hashicorp/google
09:56:36.123 INFO   terraform1.13.3: │ 
09:56:36.123 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
09:56:36.123 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
09:56:36.123 INFO   terraform1.13.3: │ these providers.
09:56:36.123 INFO   terraform1.13.3: │ 
09:56:36.123 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
09:56:36.123 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
09:56:36.124 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
09:56:36.124 INFO   terraform1.13.3: ╵
09:56:36.124 INFO   terraform1.13.3: Terraform has been successfully initialized!
09:56:39.138 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
09:56:39.138 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
09:56:39.138 STDOUT terraform1.13.3:   + create
09:56:39.138 STDOUT terraform1.13.3: Terraform will perform the following actions:
09:56:39.138 STDOUT terraform1.13.3:   # google_compute_network.vpc_network will be created
09:56:39.138 STDOUT terraform1.13.3:   + resource "google_compute_network" "vpc_network" {
09:56:39.139 STDOUT terraform1.13.3:       + auto_create_subnetworks                   = false
09:56:39.139 STDOUT terraform1.13.3:       + bgp_always_compare_med                    = (known after apply)
09:56:39.139 STDOUT terraform1.13.3:       + bgp_best_path_selection_mode              = (known after apply)
09:56:39.139 STDOUT terraform1.13.3:       + bgp_inter_region_cost                     = (known after apply)
09:56:39.140 STDOUT terraform1.13.3:       + delete_bgp_always_compare_med             = false
09:56:39.140 STDOUT terraform1.13.3:       + delete_default_routes_on_create           = false
09:56:39.140 STDOUT terraform1.13.3:       + gateway_ipv4                              = (known after apply)
09:56:39.140 STDOUT terraform1.13.3:       + id                                        = (known after apply)
09:56:39.140 STDOUT terraform1.13.3:       + internal_ipv6_range                       = (known after apply)
09:56:39.141 STDOUT terraform1.13.3:       + mtu                                       = (known after apply)
09:56:39.141 STDOUT terraform1.13.3:       + name                                      = "prd-vpc-australia-southeast2"
09:56:39.141 STDOUT terraform1.13.3:       + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
09:56:39.141 STDOUT terraform1.13.3:       + network_id                                = (known after apply)
09:56:39.142 STDOUT terraform1.13.3:       + numeric_id                                = (known after apply)
09:56:39.142 STDOUT terraform1.13.3:       + project                                   = "iac-01"
09:56:39.142 STDOUT terraform1.13.3:       + routing_mode                              = (known after apply)
09:56:39.142 STDOUT terraform1.13.3:       + self_link                                 = (known after apply)
09:56:39.142 STDOUT terraform1.13.3:     }
09:56:39.142 STDOUT terraform1.13.3:   # google_compute_subnetwork.subnet will be created
09:56:39.143 STDOUT terraform1.13.3:   + resource "google_compute_subnetwork" "subnet" {
09:56:39.143 STDOUT terraform1.13.3:       + creation_timestamp         = (known after apply)
09:56:39.143 STDOUT terraform1.13.3:       + external_ipv6_prefix       = (known after apply)
09:56:39.143 STDOUT terraform1.13.3:       + fingerprint                = (known after apply)
09:56:39.143 STDOUT terraform1.13.3:       + gateway_address            = (known after apply)
09:56:39.143 STDOUT terraform1.13.3:       + id                         = (known after apply)
09:56:39.143 STDOUT terraform1.13.3:       + internal_ipv6_prefix       = (known after apply)
09:56:39.144 STDOUT terraform1.13.3:       + ip_cidr_range              = "10.0.0.0/24"
09:56:39.144 STDOUT terraform1.13.3:       + ipv6_cidr_range            = (known after apply)
09:56:39.144 STDOUT terraform1.13.3:       + ipv6_gce_endpoint          = (known after apply)
09:56:39.144 STDOUT terraform1.13.3:       + name                       = "prd-vpc-australia-southeast2-subnet"
09:56:39.144 STDOUT terraform1.13.3:       + network                    = (known after apply)
09:56:39.144 STDOUT terraform1.13.3:       + private_ip_google_access   = (known after apply)
09:56:39.145 STDOUT terraform1.13.3:       + private_ipv6_google_access = (known after apply)
09:56:39.145 STDOUT terraform1.13.3:       + project                    = "iac-01"
09:56:39.145 STDOUT terraform1.13.3:       + purpose                    = (known after apply)
09:56:39.145 STDOUT terraform1.13.3:       + region                     = "australia-southeast2"
09:56:39.145 STDOUT terraform1.13.3:       + self_link                  = (known after apply)
09:56:39.145 STDOUT terraform1.13.3:       + stack_type                 = (known after apply)
09:56:39.146 STDOUT terraform1.13.3:       + state                      = (known after apply)
09:56:39.146 STDOUT terraform1.13.3:       + subnetwork_id              = (known after apply)
09:56:39.146 STDOUT terraform1.13.3:       + secondary_ip_range (known after apply)
09:56:39.146 STDOUT terraform1.13.3:     }
09:56:39.146 STDOUT terraform1.13.3: Plan: 2 to add, 0 to change, 0 to destroy.
09:56:39.146 STDOUT terraform1.13.3: 
09:56:39.146 STDOUT terraform1.13.3: Changes to Outputs:
09:56:39.146 STDOUT terraform1.13.3:   + network_id       = (known after apply)
09:56:39.146 STDOUT terraform1.13.3:   + subnet_self_link = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/prd/australia-southeast2
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Fiac%252Fnz3es%252Fgcp%252Fprd%252Faustralia-southeast2%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/prd/australia-southeast2
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```